tomikazi/ESP32Gizmo/ESP32Gizmo.cpp
#include <ESP32Gizmo.h>
#include <ESP32GizmoHTML.h>
#include <FS.h>
#include <SPIFFS.h>

#include <ESPmDNS.h>
#include <ESP32httpUpdate.h>
#include <ArduinoOTA.h>
#include <DNSServer.h>

#define LED 2

// WiFi connection attributes
#define WIFI_CHANNEL       11
#define MAX_CONNECTIONS     8

#define GIZMO_CONSOLE_TOPIC   "gizmo/console"
#define GIZMO_CONTROL_TOPIC  "gizmo/control"

#define MQTT_RECONNECT_FREQUENCY    5000

#define MAX_TOPIC_SIZE  64
#define MAX_TOPIC_COUNT 16
static char topics[MAX_TOPIC_COUNT][MAX_TOPIC_SIZE];
static int topicCount = 0;

static boolean callAfterConnection = false;
static boolean booted = false;
static boolean disconnected = true;
static boolean mqttConfigured = false;
static uint32_t lastReconnectAttempt = 0;
static uint32_t restartTime = 0;
static uint32_t updateTime = 0;
static uint32_t fileUpdateTime = 0;

static const char *scheduledTopic = NULL;
static char *scheduledPayload = NULL;
static boolean scheduledRetain = false;

#define MAX_ANNOUNCE_MESSAGE_SIZE   128
static char announceMessage[MAX_ANNOUNCE_MESSAGE_SIZE];

#define MAX_WILL_TOPIC_SIZE     128
static char defaultWillTopic[MAX_ANNOUNCE_MESSAGE_SIZE];
#define MAX_WILL_MESSAGE_SIZE   128
static char defaultWillMessage[MAX_ANNOUNCE_MESSAGE_SIZE];

#define DNS_PORT    53

DNSServer dnsServer;

#define OFFLINE_TIMEOUT     60000
static uint32_t offlineTime;

WiFiUDP ntpUDP;

ESPGizmo::ESPGizmo() {
}

const char *ESPGizmo::getName() {
    return name;
}

const char *ESPGizmo::getHostname() {
    return hostname;
}

const char *ESPGizmo::getSSID() {
    return ssid;
}

const char *ESPGizmo::getMAC() {
    return mac;
}

const IPAddress ESPGizmo::getIP() {
    return apIP;
};

const char *ESPGizmo::getTopicPrefix() {
    return topicPrefix[0] != '\0' ? topicPrefix : hostname;
}

WebServer *ESPGizmo::httpServer() {
    return server;
}

NTPClient *ESPGizmo::timeClient() {
    return ntpClient;
}

void ESPGizmo::led(boolean on) {
    digitalWrite(LED, on ? LOW : HIGH);
}

void ESPGizmo::initToSaneValues() {
    ssid[0] = '\0';
    passkey[0] = '\0';
    mqttHost[0] = '\0';
    mqttUser[0] = '\0';
    mqttPass[0] = '\0';
}

void ESPGizmo::setCallback(void (*callback)(char *, uint8_t *, unsigned int)) {
    mqttCallback = callback;
}

void replaceSubstring(char *string, const char *sub, const char *rep) {
    int stringLen, subLen, newLen;
    int i = 0, j, k;
    int flag = 0, start, end;
    stringLen = strlen(string);
    subLen = strlen(sub);
    newLen = strlen(rep);

    for (i = 0; i < stringLen; i++) {
        flag = 0;
        start = i;
        for (j = 0; string[i] == sub[j]; j++, i++) /* Checks for the substring */
            if (j == subLen - 1)
                flag = 1;
        end = i;
        if (flag == 0)
            i -= j;
        else {
            for (j = start; j < end; j++) {
                for (k = start; k < stringLen; k++)
                    string[k] = string[k + 1];
                stringLen--;
                i--;
            }

            for (j = start; j < start + newLen; j++) {
                for (k = stringLen; k >= j; k--)
                    string[k + 1] = string[k];
                string[j] = rep[j - start];
                stringLen++;
                i++;
            }
        }
    }
}

void ESPGizmo::addTopic(const char *topic) {
    addTopic(topic, getTopicPrefix());
}

void ESPGizmo::addTopic(const char *topic, const char *uniqueName) {
    if (topicCount < MAX_TOPIC_COUNT) {
        strncpy(topics[topicCount], topic, MAX_TOPIC_SIZE - 1);
        replaceSubstring(topics[topicCount], "%s", uniqueName);
        topicCount = topicCount + 1;
    }
}

void ESPGizmo::publish(const char *topic, char *payload) {
    publish(topic, payload, false);
}

void ESPGizmo::publish(const char *topic, const char *payload) {
    publish(topic, (char *) payload);
}

void ESPGizmo::publish(const char *topic, char *payload, boolean retain) {
    if (mqttConfigured && mqtt) {
        if (strstr(topic, "%s")) {
            char tt[MAX_TOPIC_SIZE];
            snprintf(tt, MAX_TOPIC_SIZE, topic, getTopicPrefix());
            mqtt->publish(tt, payload, retain);
        } else {
            mqtt->publish(topic, payload, retain);
        }
    } else {
        Serial.printf("no mqtt...");
    }
}

void ESPGizmo::publish(const char *topic, const char *payload, boolean retain) {
    publish(topic, (char *) payload, retain);
}

void ESPGizmo::schedulePublish(const char *topic, char *payload, boolean retain) {
    scheduledRetain = retain;
    scheduledPayload = payload;
    scheduledTopic = topic;
}

void ESPGizmo::schedulePublish(const char *topic, char *payload) {
    schedulePublish(topic, payload, false);
}

void ESPGizmo::schedulePublish(const char *topic, const char *payload, boolean retain) {
    schedulePublish(topic, (char *) payload, retain);
}

void ESPGizmo::schedulePublish(const char *topic, const char *payload) {
    schedulePublish(topic, payload, false);
}

void ESPGizmo::handleMQTTMessage(const char *topic, const char *value) {
    if (!strcmp(topic, GIZMO_CONTROL_TOPIC)) {
        if (!strcmp(value, "version")) {
            schedulePublish((char *) GIZMO_CONSOLE_TOPIC, announceMessage, false);
        } else if (!strncmp(value, "update ", 7) &&
                   (strstr(hostname, value+7) || (strlen(topicPrefix) && strstr(topicPrefix, value+7)))) {
            scheduleUpdate();
        } else if (!strncmp(value, "fileUpdate ", 11) &&
                   (strstr(hostname, value+11) || (strlen(topicPrefix) && strstr(topicPrefix, value+11)))) {
            scheduleFileUpdate();
        } else if (!strncmp(value, "restart ", 8) && strstr(hostname, value+8)) {
            scheduleRestart();
        } else if (!strncmp(value, "debug=", 6) && strstr(hostname, value+8)) {
            debugEnabled = value[6] == 'y';
        }
    }
}

bool ESPGizmo::publishBinarySensor(bool nv, bool ov, const char *topic) {
    if (nv && !ov) {
        publish(topic, "on", true);
    } else if (!nv && ov) {
        publish(topic, "off", true);
    }
    return nv;
}

void ESPGizmo::debug(const char *fmt, ...) {
    if (debugEnabled) {
        va_list argList;
        va_start(argList, fmt);
        char dmsg[256];
        dmsg[0] = '\0';
        vsnprintf(dmsg, 255, fmt, argList);
        va_end(argList);

        char line[300];
        line[0] = '\0';
        snprintf(line, 299, "%s: %s", getHostname(), dmsg);
        publish("gizmo/console", line);
    }
}

