tomikazi/ESP32Gizmo/ESP32Gizmo.cpp
void ESPGizmo::suggestIP(IPAddress ipAddress) {
    apIP = ipAddress;
}

void ESPGizmo::beginSetup(const char *_name, const char *_version, const char *_passkey) {
    Serial.begin(115200);
    pinMode(LED, OUTPUT);
    led(true);
    SPIFFS.begin();

    initToSaneValues();

    strncpy(name, _name, MAX_NAME_SIZE - 1);
    strncpy(version, _version, MAX_VERSION_SIZE - 1);
    strncpy(passkeyLocal, _passkey, MAX_PASSKEY_SIZE - 1);
    Serial.printf("\n\n%s version %s\n\n", name, version);

    setupWiFi();
    setupMQTT();
    setupOTA();
    setupHTTPServer();
}

void ESPGizmo::setupNTPClient() {
    ntpClient = new NTPClient(ntpUDP, "pool.ntp.org", -7 * 3600);
}

void ESPGizmo::endSetup() {
    offlineTime = strlen(getSSID()) ? millis() + OFFLINE_TIMEOUT : millis();
    server->begin();
    Serial.println("HTTP server started");
}

void ESPGizmo::scheduleRestart() {
    Serial.printf("Scheduling restart\n");
    restartTime = millis() + 1500;
}

void ESPGizmo::scheduleUpdate() {
    Serial.printf("Scheduling update\n");
    updateTime = millis() + 1500;
}

void ESPGizmo::scheduleFileUpdate() {
    Serial.printf("Scheduling file update\n");
    fileUpdateTime = millis() + 1500;
}

void ESPGizmo::handleRoot() {
    File f = SPIFFS.open("/index.html", "r");
    server->streamFile(f, "text/html");
    f.close();
}

void ESPGizmo::handleNetworkScanPage() {
    server->setContentLength(CONTENT_LENGTH_UNKNOWN);
    server->send(200, "text/html", HTML_HEAD);
    server->sendContent("Network Setup");
    server->sendContent(HTML_TITLE_END);
    server->sendContent(HTML_CSS_MENU);
    server->sendContent(HTML_BODY);
    server->sendContent("Network Setup");
    server->sendContent(HTML_MENU);

    server->sendContent("<form action=\"/netcfg\"><h3>Name</h3><input type=\"text\" name=\"name\" value=\"");
    if (strlen(hostname)) server->sendContent(hostname);
    server->sendContent(
            "\" size=\"30\"><h3>Network</h3><select id=\"netlist\" onchange='document.getElementById(\"net\").value = document.getElementById(\"netlist\").value'>");

    int n = WiFi.scanNetworks();
    for (int i = 0; i < n; i++) {
        server->sendContent("<option value=\"");
        server->sendContent(WiFi.SSID(i).c_str());
        if (!strcmp(WiFi.SSID(i).c_str(), ssid)) {
            server->sendContent("\" selected>");
        } else {
            server->sendContent("\">");
        }
        server->sendContent(WiFi.SSID(i).c_str());
        server->sendContent("</option>");
    }

    server->sendContent("</select><p><input type=\"text\" id=\"net\" name=\"net\" value=\"");
    if (strlen(ssid)) server->sendContent(ssid);
    server->sendContent("\" size=\"30\"><h3>Password</h3><input type=\"password\" name=\"pass\" value=\"");
    if (strlen(passkey)) server->sendContent(passkey);
    server->sendContent("\" size=\"30\"><p><h3>IP Address</h3>");
    server->sendContent(disconnected ? "not connected" : WiFi.localIP().toString().c_str());
    server->sendContent("<p><p><h3>MAC Address</h3>");
    server->sendContent(getMAC());
    server->sendContent("<p><input type=\"submit\" value=\"Apply Changes\"></form>");
    server->sendContent(HTML_END);
    server->sendContent("");
}

void ESPGizmo::handleNetworkConfig() {
    strncpy(hostname, server->arg("name").c_str(), MAX_SSID_SIZE - 1);
    strncpy(ssid, server->arg("net").c_str(), MAX_SSID_SIZE - 1);
    strncpy(passkey, server->arg("pass").c_str(), MAX_PASSKEY_SIZE - 1);
    Serial.printf("Reconfiguring for connection to %s\n", ssid);

    server->setContentLength(CONTENT_LENGTH_UNKNOWN);
    server->send(200, "text/html", HTML_HEAD);
    server->sendContent("Network Configured");
    server->sendContent(HTML_TITLE_END);
    server->sendContent(HTML_REDIRECT_START);
    server->sendContent("/nets");
    server->sendContent(HTML_REDIRECT_END);
    server->sendContent(HTML_CSS_MENU);
    server->sendContent(HTML_BODY);
    server->sendContent("Network Configured");
    server->sendContent(HTML_MENU);
    server->sendContent("<p>Reconfigured WiFi for connection to ");
    if (strlen(ssid)) server->sendContent(ssid);
    server->sendContent(". Restarting...</p>");
    server->sendContent(HTML_END);
    server->sendContent("");

    saveNetworkConfig();
    WiFi.disconnect(true);
    scheduleRestart();
}

void ESPGizmo::handleEraseConfig() {
    Serial.printf("Resetting configuration\n");

    server->setContentLength(CONTENT_LENGTH_UNKNOWN);
    server->send(200, "text/html", HTML_HEAD);
    server->sendContent("Config Reset");
    server->sendContent(HTML_TITLE_END);
    server->sendContent(HTML_REDIRECT_START);
    server->sendContent("/nets");
    server->sendContent(HTML_REDIRECT_END);
    server->sendContent(HTML_CSS_MENU);
    server->sendContent(HTML_BODY);
    server->sendContent("Config Reset");
    server->sendContent(HTML_MENU);
    server->sendContent("<p>Erasing configuration. Restarting...</p>");
    server->sendContent(HTML_END);
    server->sendContent("");

    SPIFFS.remove("/cfg/wifi");
    SPIFFS.remove("/cfg/mqtt");
    WiFi.disconnect(true);
    scheduleRestart();
}

void ESPGizmo::handleMQTTPage() {
    char port[8];

    server->setContentLength(CONTENT_LENGTH_UNKNOWN);
    server->send(200, "text/html", HTML_HEAD);
    server->sendContent("MQTT Setup");
    server->sendContent(HTML_TITLE_END);
    server->sendContent(HTML_CSS_MENU);
    server->sendContent(HTML_BODY);
    server->sendContent("MQTT Setup");
    server->sendContent(HTML_MENU);

    server->sendContent("<form action=\"/mqttcfg\"><h3>MQTT Host</h3><input type=\"text\" name=\"host\" value=\"");
    if (strlen(mqttHost)) server->sendContent(mqttHost);
    server->sendContent("\" size=\"30\"><h3>MQTT Port</h3><input type=\"text\" name=\"port\" value=\"");
    snprintf(port, 8, "%d", mqttPort);
    server->sendContent(port);
    server->sendContent("\" size=\"30\"><p><h3>User Name</h3><input type=\"password\" name=\"user\" value=\"");
    if (strlen(mqttUser)) server->sendContent(mqttUser);
    server->sendContent("\" size=\"30\"><p><h3>Password</h3><input type=\"password\" name=\"pass\" value=\"");
    if (strlen(mqttPass)) server->sendContent(mqttPass);
    server->sendContent("\" size=\"30\"><p><h3>Topic Prefix</h3><input type=\"text\" name=\"prefix\" value=\"");
    if (strlen(topicPrefix)) server->sendContent(topicPrefix);
    server->sendContent("\" size=\"30\"><p><input type=\"submit\" value=\"Apply Changes\"></form>");
    server->sendContent(HTML_END);
    server->sendContent("");
}

void ESPGizmo::handleMQTTConfig() {
    char port[8];
    strncpy(mqttHost, server->arg("host").c_str(), MAX_MQTT_HOST_SIZE - 1);
    strncpy(port, server->arg("port").c_str(), 7);
    mqttPort = atoi(port);
    strncpy(mqttUser, server->arg("user").c_str(), MAX_MQTT_USER_SIZE - 1);
    strncpy(mqttPass, server->arg("pass").c_str(), MAX_MQTT_PASS_SIZE - 1);
    strncpy(topicPrefix, server->arg("prefix").c_str(), MAX_SSID_SIZE - 1);
    Serial.printf("Reconfiguring for connection to %s\n", mqttHost);

    server->setContentLength(CONTENT_LENGTH_UNKNOWN);
    server->send(200, "text/html", HTML_HEAD);
    server->sendContent("MQTT Reconfigured");
    server->sendContent(HTML_TITLE_END);
    server->sendContent(HTML_REDIRECT_START);
    server->sendContent("/mqtt");
    server->sendContent(HTML_REDIRECT_END);
    server->sendContent(HTML_CSS_MENU);
    server->sendContent(HTML_BODY);
    server->sendContent("MQTT Reconfigured");
    server->sendContent(HTML_MENU);
    server->sendContent("<p>Reconfigured MQTT for connection to ");
    if (strlen(mqttHost)) server->sendContent(mqttHost);
    server->sendContent(". Restarting...</p>");
    server->sendContent(HTML_END);
    server->sendContent("");

    saveMQTTConfig();
    WiFi.disconnect(true);
    scheduleRestart();
}

void ESPGizmo::handleUpdate() {
    server->setContentLength(CONTENT_LENGTH_UNKNOWN);
    server->send(200, "text/html", HTML_HEAD);
    server->sendContent("Software Update");
    server->sendContent(HTML_TITLE_END);
    server->sendContent(HTML_CSS_MENU);
    server->sendContent(HTML_BODY);
    server->sendContent("Software Update");
    server->sendContent(HTML_MENU);

    server->sendContent("<h3>Name</h3>");
    if (strlen(name)) server->sendContent(name);
    server->sendContent("<h3>Version</h3>");
    if (strlen(version)) server->sendContent(version);
    server->sendContent("<h3>URL</h3>");
    if (strlen(updateUrl)) server->sendContent(updateUrl);

