tomikazi/ESP32Gizmo/ESP32Gizmo.cpp
    server->sendContent("<p><form action=\"/doupdate\"><input type=\"submit\" value=\"Update\"></form>");
    server->sendContent("<p><form action=\"/dofileupdate\"><input type=\"submit\" value=\"Update Files\"></form>");
    server->sendContent("<br><br><form action=\"/reset\"><input type=\"submit\" value=\"Reset\"></form>");
    server->sendContent("<br><br><form action=\"javascript:if (confirm('This will erase custom configuration!')) { window.location.href = '/erase'; }\"><input type=\"submit\" value=\"Erase Config\"></form>");
    server->sendContent(HTML_END);
    server->sendContent("");
}

void ESPGizmo::handleDoUpdate() {
    server->setContentLength(CONTENT_LENGTH_UNKNOWN);
    server->send(200, "text/html", HTML_HEAD);
    server->sendContent("Update Requested");
    server->sendContent(HTML_TITLE_END);
    server->sendContent(HTML_REDIRECT_LONG_START);
    server->sendContent("/update");
    server->sendContent(HTML_REDIRECT_END);
    server->sendContent(HTML_CSS_MENU);
    server->sendContent(HTML_BODY);
    server->sendContent("Update Requested");
    server->sendContent(HTML_MENU);
    server->sendContent("<p>Update requested from ");
    if (strlen(updateUrl)) server->sendContent(updateUrl);
    server->sendContent("</p><p>Restarting...</p>");
    server->sendContent(HTML_END);
    server->sendContent("");
    scheduleUpdate();
}

void ESPGizmo::handleDoFileUpdate() {
    server->setContentLength(CONTENT_LENGTH_UNKNOWN);
    server->send(200, "text/html", HTML_HEAD);
    server->sendContent("Updating Files");
    server->sendContent(HTML_TITLE_END);
    server->sendContent(HTML_REDIRECT_START);
    server->sendContent("/files");
    server->sendContent(HTML_REDIRECT_END);
    server->sendContent(HTML_CSS_MENU);
    server->sendContent(HTML_BODY);
    server->sendContent("Updating Files");
    server->sendContent(HTML_MENU);
    server->sendContent("<p>Update requested from ");
    if (strlen(updateUrl)) server->sendContent(updateUrl);
    server->sendContent("</p><p>Please wait...</p>");
    server->sendContent(HTML_END);
    server->sendContent("");
    scheduleFileUpdate();
}

void ESPGizmo::handleReset() {
    server->setContentLength(CONTENT_LENGTH_UNKNOWN);
    server->send(200, "text/html", HTML_HEAD);
    server->sendContent("Resetting...");
    server->sendContent(HTML_TITLE_END);
    server->sendContent(HTML_REDIRECT_START);
    server->sendContent("/update");
    server->sendContent(HTML_REDIRECT_END);
    server->sendContent(HTML_CSS_MENU);
    server->sendContent(HTML_BODY);
    server->sendContent("Resetting...");
    server->sendContent(HTML_MENU);
    server->sendContent("<p>Reset requested!</p><p>Please wait...</p>");
    server->sendContent(HTML_END);
    server->sendContent("");
    scheduleRestart();
}

void listDir(WebServer *server, const char *path) {
    File dir = SPIFFS.open(path);
    File file = dir.openNextFile();
    while (file) {
        char line[128];
        char name[48];
        name[0] = '\0';
        strncat(name, file.name(), 47);
        Serial.printf("%s\t%d\n", name, file.size());
        snprintf(line, 127, "%-32s %8d<br>", name, file.size());
        server->sendContent(line);
        file = dir.openNextFile();
    }
}

void ESPGizmo::handleFiles() {
    server->setContentLength(CONTENT_LENGTH_UNKNOWN);
    server->send(200, "text/html", HTML_HEAD);
    server->sendContent("Files");
    server->sendContent(HTML_TITLE_END);
    server->sendContent(HTML_CSS_MENU);
    server->sendContent(HTML_BODY);
    server->sendContent("Files");
    server->sendContent(HTML_MENU);
    server->sendContent("<pre>");

    listDir(server, "/");

    server->sendContent("</pre>");
    server->sendContent("<p><form action=\"/dofileupdate\"><input type=\"submit\" value=\"Update Files\"></form>");
    if (updatingFiles) {
        server->sendContent("<p>File update in progress...<p>");
    }
    if (fileUploadFailed) {
        server->sendContent("<p>File update failed!<p>");
    }
    server->sendContent(HTML_END);
    server->sendContent("");
}

static File uploadFile;
static uint32_t uploadSize;

void ESPGizmo::preUpload() {
    if (onUpdate) {
        onUpdate();
    }
    server->send(200, "text/plain", "");
}

void ESPGizmo::startUpload() {
    server->send(200, "text/plain", "");
}

void ESPGizmo::handleUpload() {
    static char name[64];

    HTTPUpload &upload = server->upload();
    snprintf(name, 63, "/%s", upload.filename.c_str());
    Serial.printf("Uploading %s... phase %d, total=%u, current=%u, name=%s, type=%s\n",
                  name, upload.status, upload.totalSize, upload.currentSize,
                  upload.name.c_str(), upload.type.c_str());

    if (upload.status == UPLOAD_FILE_START) {
        Serial.printf("Starting upload for %s\n", name);
        uploadFile = SPIFFS.open(name, "w");
        if (!uploadFile) {
            Serial.printf("Upload failed to open destination file\n");
        }
        uploadSize = 0;

    } else if (upload.status == UPLOAD_FILE_WRITE) {
        if (uploadFile) {
            uploadSize += uploadFile.write(upload.buf, upload.currentSize);
        }

    } else if (upload.status == UPLOAD_FILE_END) {
        if (uploadFile) {
            uploadFile.close();
        }
        Serial.printf("Uploaded %u bytes\n", uploadSize);
    }
    yield();
}

void ESPGizmo::restart() {
    Serial.println("Restarting...");
    ESP.restart();
}


int captiveCount = 0;

void ESPGizmo::handleHotSpotDetect() {
    Serial.printf("hotSpotDetect [%d, %s]\n", captiveCount, server->uri().c_str());
    if (captiveCount == 0) {
        server->send(200, "text/html", "<HTML><HEAD><TITLE>Captive</TITLE></HEAD><BODY>Captive</BODY></HTML>");
        captiveCount++;
    } else if (captiveCount == 1) {
        char buf[2048];
        snprintf(buf, 2047, WELCOME_HTML, apIP.toString().c_str(), apIP.toString().c_str());
        server->send(200, "text/html", buf);
        captiveCount++;
    } else {
        server->send(200, "text/html", "<HTML><HEAD><TITLE>Success</TITLE></HEAD><BODY>Success</BODY></HTML>");
        captiveCount = 0;
    }
}

void ESPGizmo::handleNotFound() {
    Serial.printf("notFound [%d, %s]\n", captiveCount, server->uri().c_str());
    handleNetworkScanPage();
    captiveCount = 0;
}

void ESPGizmo::setNetworkConfig(const char *filename) {
    networkConfig = filename;
    Serial.printf("Switching WiFi configuration to %s...\n", networkConfig);
    WiFi.disconnect(true);
    setupWiFi();
}

