tomikazi/ESP32Gizmo/ESP32Gizmo.cpp
void ESPGizmo::setNoNetworkConfig() {
    networkConfig = "";
    Serial.printf("Switching WiFi configuration to AP only\n");
    WiFi.disconnect(true);
    setupWiFi();
}

void ESPGizmo::setupWiFi() {
    Serial.println("Setting up WiFi");
    strncpy(hostname, name, MAX_SSID_SIZE);
    WiFi.setAutoConnect(false);
    ssid[0] = '\0';

    if (strlen(networkConfig)) {
        loadNetworkConfig();
    }

    boolean isStation = strlen(ssid);
    if (isStation) {
        Serial.printf("Attempting connection to %s\n", ssid);
        WiFi.persistent(false);
        WiFi.begin(ssid, passkey);
    } else {
        Serial.printf("No WiFi connection configured\n");
    }

    WiFi.softAPmacAddress(macAddr);
    sprintf(mac, "%02X:%02X:%02X:%02X:%02X:%02X",
            macAddr[0], macAddr[1], macAddr[2], macAddr[3], macAddr[4], macAddr[5]);
    sprintf(defaultHostname, "%s-%02X%02X%02X", name, macAddr[3], macAddr[4], macAddr[5]);
    if (strlen(hostname) < 2) {
        strcpy(hostname, defaultHostname);
    }

    // FIXME
//    uint8_t mode = 0;
//    wifi_softap_set_dhcps_offer_option(OFFER_ROUTER, &mode);

    snprintf(announceMessage, MAX_ANNOUNCE_MESSAGE_SIZE, "%s (%s)", hostname, version);

    snprintf(defaultWillTopic, MAX_WILL_TOPIC_SIZE, "%s", GIZMO_CONSOLE_TOPIC);
    snprintf(defaultWillMessage, MAX_WILL_MESSAGE_SIZE, "%s disconnected ", hostname);

    // If we don't have an SSID configured to which to connect to,
    // start as a visible access point otherwise, start as a hidden access point/station
    WiFi.mode(isStation ? WIFI_AP_STA : WIFI_AP);

    IPAddress netMask = IPAddress(255, 255, 255, 0);
    WiFi.softAPConfig(apIP, apIP, netMask);
    WiFi.softAP(hostname, passkeyLocal, WIFI_CHANNEL, false, MAX_CONNECTIONS);

//    Serial.printf("WiFi is %s\n", isStation ? "hidden" : "visible");

    dnsServer.start(DNS_PORT, "*", apIP);

    Serial.printf("WiFi %s started with gateway IP %d.%d.%d.%d\n", hostname, apIP[0], apIP[1], apIP[2], apIP[3]);
    delay(100);
}

void ESPGizmo::setupMQTT() {
    loadMQTTConfig();
    if (mqttHost && strlen(mqttHost)) {
        Serial.printf("Attempting connection to MQTT server %s\n", mqttHost);
        mqttConfigured = true;
    } else {
        Serial.println("No MQTT server configured");
    }
    delay(100);
}

void ESPGizmo::setupHTTPServer() {
    server = new WebServer(80);
    server->on("/nets", std::bind(&ESPGizmo::handleNetworkScanPage, this));
    server->on("/netcfg", std::bind(&ESPGizmo::handleNetworkConfig, this));
    server->on("/mqtt", std::bind(&ESPGizmo::handleMQTTPage, this));
    server->on("/mqttcfg", std::bind(&ESPGizmo::handleMQTTConfig, this));
    server->on("/uploadprep", std::bind(&ESPGizmo::preUpload, this));
    server->on("/upload", HTTP_POST, std::bind(&ESPGizmo::startUpload, this), std::bind(&ESPGizmo::handleUpload, this));
    server->on("/reset", std::bind(&ESPGizmo::handleReset, this));
    server->on("/files", std::bind(&ESPGizmo::handleFiles, this));
    server->on("/erase", std::bind(&ESPGizmo::handleEraseConfig, this));
    server->on("/hotspot-detect.html", std::bind(&ESPGizmo::handleHotSpotDetect, this));
}

void ESPGizmo::setUpdateURL(const char *url) {
    setUpdateURL(url, NULL);
}

void ESPGizmo::setUpdateURL(const char *url, void (*callback)()) {
    onUpdate = callback;
    updateUrl = (char *) url;
    if (strlen(updateUrl)) {
        server->on("/update", std::bind(&ESPGizmo::handleUpdate, this));
        server->on("/doupdate", std::bind(&ESPGizmo::handleDoUpdate, this));
        server->on("/dofileupdate", std::bind(&ESPGizmo::handleDoFileUpdate, this));
    }
}

void ESPGizmo::setupWebRoot() {
    server->on("/", std::bind(&ESPGizmo::handleRoot, this));
    server->serveStatic("/", SPIFFS, "/", "max-age=86400");
//
//    File dir = SPIFFS.open("/");
//    File file = dir.openNextFile();
//    while (file) {
//        server->serveStatic(file.name(), SPIFFS, file.name(), "max-age=86400");
//        file = dir.openNextFile();
//    }
}

void ESPGizmo::setupOTA() {
    ArduinoOTA.setHostname(hostname);
    ArduinoOTA.onStart([]() {
        Serial.println("OTA Started");
    });
    ArduinoOTA.onEnd([]() {
        Serial.println("\nEnd");
    });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        Serial.printf("Progress: %u%%\r", (progress / (total / 100)));
    });
    ArduinoOTA.onError([](ota_error_t error) {
        Serial.printf("Error[%u]: ", error);
        if (error == OTA_AUTH_ERROR) Serial.println("Auth Failed");
        else if (error == OTA_BEGIN_ERROR) Serial.println("Begin Failed");
        else if (error == OTA_CONNECT_ERROR) Serial.println("Connect Failed");
        else if (error == OTA_RECEIVE_ERROR) Serial.println("Receive Failed");
        else if (error == OTA_END_ERROR) Serial.println("End Failed");
    });
}

int ESPGizmo::updateSoftware(const char *url) {
    Serial.printf("Updating software from %s; current version %s\n", url, version);
    t_httpUpdate_return ret = ESPhttpUpdate.update(url, version);
    switch (ret) {
        case HTTP_UPDATE_FAILED:
            Serial.println("Software update failed.");
            return -1;
        case HTTP_UPDATE_NO_UPDATES:
            Serial.println("Software update not required.");
            return 0;
        case HTTP_UPDATE_OK:
            // may not be called due to race with reboot
            Serial.println("Software updated!");
            return 1;
    }
    return 0;
}

bool isUpTodate(const char *file, const char *etag) {
    char efn[48], et[32];
    snprintf(efn, 47, "/etags%s", file);
    File f = SPIFFS.open(efn, "r");
    if (f) {
        int l = f.readBytesUntil('\n', et, 31);
        et[l] = '\0';
        f.close();
        return !strcmp(et, etag);
    }
    return false;
}

void saveEtag(const char *file, const char *etag) {
    char efn[48];
    snprintf(efn, 47, "/etags%s", file);
    File f = SPIFFS.open(efn, "w");
    if (f) {
        f.printf("%s\n", etag);
        f.close();
    }
}

