tomikazi/ESP32Gizmo/ESP32Gizmo.cpp
int ESPGizmo::downloadAndSave(const char *url, const char *file) {
    char xurl[256];
    snprintf(xurl, 255, "%s.data%s", url, file);
    Serial.printf("Starting download of %s...\n", file);

    HTTPClient httpClient;
    httpClient.begin(xurl);

    const char *headerKeys[] = {"Content-Length", "ETag"};
    httpClient.collectHeaders(headerKeys, 2);

    int code = httpClient.GET();
    if (code != HTTP_CODE_OK) {
        Serial.printf("Unable to download %s\n", xurl);
        return 0;
    }

    if (!isUpTodate(file, httpClient.header("ETag").c_str())) {
        int length = httpClient.header("Content-Length").toInt();
        int downloaded = 0;
        WiFiClient *stream = httpClient.getStreamPtr();
        if (stream) {
            File f = SPIFFS.open(file, "w");
            if (f) {
                Serial.printf("Downloading %d bytes of %s ... ", length, file);
                uint8_t buf[1024];
                size_t rl;
                while ((rl = stream->read(buf, 1024)) > 0) {
                    f.write(buf, rl);
                    downloaded += rl;
                    delay(20);
                    yield();
                }
                f.close();
                Serial.printf("%d bytes\n", downloaded);
                if (length == downloaded) {
                    saveEtag(file, httpClient.header("ETag").c_str());
                }
            }
        }
        httpClient.end();
        delay(100);
        return length == downloaded;
    }
    return 1;
}

int ESPGizmo::updateFiles(const char *url) {
    updatingFiles = true;
    fileUploadFailed = !downloadAndSave(url, "/catalog");
    File cat = SPIFFS.open("/catalog", "r");
    if (cat && !fileUploadFailed) {
        char file[32];
        int l;
        while ((l = cat.readBytesUntil('\n', file, 31)) > 0) {
            file[l] = '\0';
            int t = 10;
            while (!downloadAndSave(url, file) && t > 0) {
                Serial.printf("Failed to download file %s completely; retrying\n", file);
                t--;
                delay(500);
            }
            if (t == 0) {
                Serial.printf("Failed to download file %s\n", file);
                fileUploadFailed = true;
            }
        };
        cat.close();
    }
    updatingFiles = false;
    return 0;
}

boolean ESPGizmo::mqttReconnect() {
    Serial.printf("Attempting connection to MQTT server %s as %s/%s\n",
                  mqttHost, mqttUser, mqttPass);
    if (!willTopic || !willMessage) {
        willTopic = defaultWillTopic;
        willMessage = defaultWillMessage;
//        Serial.printf("dt=%s; dm=%s\n", willTopic, willMessage);
    }

    if (mqtt->connect(defaultHostname, mqttUser, mqttPass, willTopic, willQos, willRetain, willMessage)) {
//    if (mqtt->connect(defaultHostname, mqttUser, mqttPass)) {
        // Once connected, publish an announcement and subscribe...
        mqtt->publish(GIZMO_CONSOLE_TOPIC, announceMessage, false);
        booted = true;
        updateAnnounceMessage();

        mqtt->subscribe(GIZMO_CONTROL_TOPIC);
        for (int i = 0; i < topicCount; i++) {
            mqtt->subscribe(topics[i]);
        }
    }
    return mqtt->connected();
}

void ESPGizmo::updateAnnounceMessage() {
    snprintf(announceMessage, MAX_ANNOUNCE_MESSAGE_SIZE, "%s (%s) %s/%s %s",
             hostname, version, WiFi.localIP().toString().c_str(), mac,
             booted ? "reconnect" : "boot");
}

bool ESPGizmo::isNetworkAvailable(void (*afterConnection)()) {
    boolean wifiReady = WiFi.status() == WL_CONNECTED;
    boolean mqttReady = (mqttConfigured && mqtt && mqtt->connected()) || !mqttConfigured;

    if (wifiReady) {
        if (disconnected) {
            disconnected = false;
            callAfterConnection = true;
            Serial.printf("Connected to %s with IP %s\n", ssid, WiFi.localIP().toString().c_str());

            updateAnnounceMessage();
            mqtt = new PubSubClient(mqttHost, mqttPort, wifiClient);
            mqtt->setCallback(mqttCallback);

            ArduinoOTA.begin();
            if (MDNS.begin(hostname)) {
                MDNS.addService("http", "tcp", 80);
            }
        }

        if (mqtt && mqttConfigured) {
            if (!mqtt->connected()) {
                uint32_t now = millis();
                if (now - lastReconnectAttempt > MQTT_RECONNECT_FREQUENCY) {
                    lastReconnectAttempt = now;
                    if (mqttReconnect()) {
                        lastReconnectAttempt = 0;
                    }
                }
            } else {
                if (scheduledTopic) {
                    publish(scheduledTopic, scheduledPayload, scheduledRetain);
                    scheduledTopic = NULL;
                    scheduledPayload = NULL;
                }
                mqtt->loop();
            }
        }

        if (callAfterConnection && mqttReady && afterConnection) {
            if (ntpClient) {
                ntpClient->begin();
            }
            callAfterConnection = false;
            offlineTime = 0;
            afterConnection();
            led(false);
        }

        ArduinoOTA.handle();
    }
    dnsServer.processNextRequest();
    server->handleClient();

    if (ntpClient) {
        ntpClient->update();
    }

    if (updateTime && updateTime < millis()) {
        if (onUpdate) {
            onUpdate();
        }
        updateFiles(updateUrl);
        updateSoftware(updateUrl);
        updateTime = 0;
    }

    if (fileUpdateTime && fileUpdateTime < millis()) {
        if (onUpdate) {
            onUpdate();
        }
        updateFiles(updateUrl);
        fileUpdateTime = 0;
    }

    if (restartTime && restartTime < millis()) {
        restart();
    }

    if (!wifiReady) {
        disconnected = true;
        led(true);
    }

    // If we're still not ready and the offline time grace period ran-out, run without WiFi.
    if (!(wifiReady && mqttReady) && offlineTime && offlineTime < millis()) {
        setNoNetworkConfig();
        callAfterConnection = false;
        offlineTime = 0;
        afterConnection();
    }

    return wifiReady && mqttReady;
}

char *trimWhiteSpace(char *str) {
    char *end;

