tomikazi/ESP32Gizmo/ESP32Gizmo.cpp
    // Trim leading space
    while (isspace((unsigned char) *str)) str++;

    if (*str == 0)  // All spaces?
        return str;

    // Trim trailing space
    end = str + strlen(str) - 1;
    while (end > str && isspace((unsigned char) *end)) end--;

    // Write new null terminator character
    end[1] = '\0';

    return str;
}

void ESPGizmo::loadNetworkConfig() {
    File f = SPIFFS.open(normalizeFile(networkConfig), "r");
    if (f) {
        int l = f.readBytesUntil('|', ssid, MAX_SSID_SIZE - 1);
        ssid[l] = '\0';
        l = f.readBytesUntil('|', passkey, MAX_PASSKEY_SIZE - 1);
        passkey[l] = '\0';
        l = f.readBytesUntil('|', hostname, MAX_SSID_SIZE - 1);
        hostname[l] = '\0';
        trimWhiteSpace(hostname);
        f.close();
    }
}

void ESPGizmo::saveNetworkConfig() {
    File f = SPIFFS.open("/cfg/wifi", "w");
    if (f) {
        f.printf("%s|%s|%s|\n", ssid, passkey, hostname);
        f.close();
    }
}

void ESPGizmo::setMQTTLastWill(const char *willTopic, const char *willMessage,
                               uint8_t willQos, bool willRetain) {
    Serial.printf("Not implemented yet: %s, %s, %d, %d", willTopic, willMessage, willQos, willRetain);
}

void ESPGizmo::loadMQTTConfig() {
    File f = SPIFFS.open(normalizeFile("cfg/mqtt"), "r");
    if (f) {
        int l = f.readBytesUntil('|', mqttHost, MAX_MQTT_HOST_SIZE - 1);
        char port[8];
        mqttHost[l] = '\0';
        l = f.readBytesUntil('|', port, 7);
        port[l] = '\0';
        mqttPort = atoi(port);
        l = f.readBytesUntil('|', mqttUser, MAX_MQTT_USER_SIZE - 1);
        mqttUser[l] = '\0';
        l = f.readBytesUntil('|', mqttPass, MAX_MQTT_PASS_SIZE - 1);
        mqttPass[l] = '\0';
        l = f.readBytesUntil('|', topicPrefix, MAX_SSID_SIZE - 1);
        topicPrefix[l] = '\0';
        f.close();
    }
}

void ESPGizmo::saveMQTTConfig() {
    File f = SPIFFS.open("/cfg/mqtt", "w");
    if (f) {
        f.printf("%s|%d|%s|%s|%s|\n", mqttHost, mqttPort, mqttUser, mqttPass, topicPrefix);
        f.close();
    }
}

static char normalized[36];

char *normalizeFile(const char *file) {
    if (file[0] == '/') {
        return (char *) file;
    }
    snprintf(normalized, 32, "/%s", file);
    if (SPIFFS.exists(file)) {
        Serial.printf("Normalizing %s\n", file);
        SPIFFS.rename(file, normalized);
    }
    return normalized;
}
